#+TITLE: aepound's Emacs Configuration
#+OPTIONS: toc:4 h:4


*** Organization of my life, etc...

| Filename         | Description                                        |
|------------------+----------------------------------------------------|
| someday.org      | The Someday/Maybe file                             |
| todo.org         | Main listing of current projects/tasks             |
| dates.org        | A listing/calendar of Bdays, anniversary, etc      |
| todo.org_archive | Archived tasks                                     |
| journal.org      | Journal/writings                                   |
| notes.org        | Everything I want to remember for some other time. |

#+BEGIN_SRC emacs-lisp
; This sets my-org-dir as "~/org/" (because user-emacs-directory = "~/.emacs.d/")
(setq my-org-dir (expand-file-name "../org/" user-emacs-directory))
; This grabs each .org file in the org-dir and adds it to the agenda view
(mapc '(lambda (fl) (add-to-list 'org-agenda-files fl))
      (directory-files my-org-dir t "\\.org"))
; This sets the default notes file as my notes.org
(setq org-default-notes-file (expand-file-name "notes.org" my-org-dir))
#+END_SRC

#+RESULTS:
: /cygdrive/c/Users/Andrew/org/notes.org
*** =org-capture=
    This is where I define my capture templates.

- Journal: This is to make a journal entrance into my personal journal.  
- Note: This is a general anything notes entry
- Todo: This is a new task to insert into the tasks list
- Appt: This is to put an appt into the calendar portion of the todo file
- ?Project: This could be a way to insert a new project template
#+BEGIN_SRC emacs-lisp
(setq org-capture-templates
  '(("j" "Journal" entry (file+datetree 
        (expand-file-name "journal.org" my-org-dir))
        "* %?\n%U\n %i\n")
    ("n" "Note" entry (file+datetree
        (expand-file-name "notes.org" my-org-dir))
        "* %?\n %i\n %a")
    ("t" "Todo" entry (file+headline 
        (expand-file-name "todo.org" my-org-dir) "Tasks")
        "* TODO %?\n %i\n %a")
    ("a" "Appt" entry (file+headline
        (expand-file-name "todo.org" my-org-dir) "Calendar")
        "* APPT %?\n %^T\n %i\n %a")
   )
)                   

#+END_SRC

#+RESULTS:
| j | Journal | entry | (file+datetree (expand-file-name journal.org my-org-dir))       | * %?\n%U\n %i\n           |
| n | Note    | entry | (file+datetree (expand-file-name notes.org my-org-dir))         | * %?\n %i\n %a            |
| t | Todo    | entry | (file+headline (expand-file-name todo.org my-org-dir) Tasks)    | * TODO %?\n %i\n %a       |
| a | Appt    | entry | (file+headline (expand-file-name todo.org my-org-dir) Calendar) | * APPT %?\n %^T\n %i\n %a |

